#-------------------------------------------Задание--------------------------------------------------------#
"""
Дан прямоугольник размером a (например: 647) x  b(например: 170). Сколько квадратов
со стороной 30 можно вырезать из него?
Для решения задачи использовать переменные для задания
размеров прямоугольника
а также переменную для записи результата
"""
# a = 647
# b = 170
# c = 30
# count_of_height = a // c # countHeight
# count_of_length = b // c
# all_count_square = count_of_height * count_of_length
# print("Количество квадратов, которые можно вырезать из заданного прямоугольника:", all_count_square)
#





# a = 5
# b = 3
# print(b)# 3
#
# a, b = b, a
# print(b)# 5
#
# c, d, e, f = 4, b, 7, "book"
# print(b)# 5


#https://digitology.tech/docs/python_3/library/turtle.html
from turtle import *                                   # import  turtle

# shape("turtle")
# a = int(input("Введите сторону квадрата "))
# forward(a)
# left(90)
# forward(a)
# left(90)
# forward(a)
# left(90)
# forward(a)
# left(90)


#---------------------------------------------условные операторы-----------------------------------------------------#
# если температура > 0 , то напечатать "тепло", иначе напечтать "Холодно"
# if -  если


t = -10 # 10 , 1000 , -10

#  t > 0 -> False при t = -10
#  print("тепло") будет исполнена только в том случае, если было возращено True
if t > 0: print("тепло") # True, False - логические типы данных



#--------------------------------------------Операторы сравнения----------------------------------------------------------------#
# # >     <    >=   <=
# # ==   точное сравнение
# # != не равно
# t = 10000
# if t > 0: print("тепло")


# #-------------------------------------треугольник------------------------------------------------#
shape("turtle")
a = int(input("Введите сторону треугольника "))
if a > 0:
    forward(a)
    left(120)
    forward(a)
    left(120)
    forward(a)
    left(120)

import time
time.sleep(10)
