#-------------------------------------Задача---------------------------------------#
# Выведите столбец чисел от 1 до 100, используя цикл while #
start = 1
end = 100
while start <= end:
     print(start)
     start += 1
#


#-------------------------------------Задача---------------------------------------#
# Дано число n. Вывести степени этого числа с 1 по 10
# пример:
# n=2
# 2^1=2
# 2^2=4
#
a = int(input())
count_exp = 0
while count_exp != 11:
        print("2 ^", count_exp, "=", a ** count_exp)
        count_exp += 1
#


#-------------------------------------Задача---------------------------------------#
# написать программу для черепашки
# звезда с 12 лучами
#
from turtle import *
side = 0
while side != 12:
        forward(200)
        right(150)
        side += 1
#
#-----------------------------------------------------------------------------------#